In [37]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\baivab bhusal\miniconda3\envs\csit82\lib\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\baivab bhusal\miniconda3\envs\csit82\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\baivab bhusal\miniconda3\envs\csit82\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\baivab bhusal\miniconda3\envs\csit82\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\baivab bhusal\miniconda3\envs\csit82\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\baivab bhusal\miniconda3\envs\csit82\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [38]:
import pandas as pd

### pandas
- series 1D array
- dataframe 2D array

#### Series

In [39]:
# creating series from list and tuple
s1=pd.Series([10,20,30,40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [40]:
import numpy as np
a=np.arange(10,60,10)
a

array([10, 20, 30, 40, 50])

In [41]:
s2=pd.Series(a)
s2

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [42]:
s2=pd.Series(a, name="Demo")
s2

0    10
1    20
2    30
3    40
4    50
Name: Demo, dtype: int64

In [43]:
labels=["f","s","t","fo","fi"]
s2=pd.Series(a, name="Demo",index=labels)
s2

f     10
s     20
t     30
fo    40
fi    50
Name: Demo, dtype: int64

In [44]:
s2.loc['f']

np.int64(10)

In [45]:
s2.iloc[2]

np.int64(30)

In [46]:
s2.add(1)

f     11
s     21
t     31
fo    41
fi    51
Name: Demo, dtype: int64

In [47]:
s2+1

f     11
s     21
t     31
fo    41
fi    51
Name: Demo, dtype: int64

In [48]:
s2*3

f      30
s      60
t      90
fo    120
fi    150
Name: Demo, dtype: int64

In [49]:
s2.multiply(5)

f      50
s     100
t     150
fo    200
fi    250
Name: Demo, dtype: int64

In [50]:
np.cos(s2)

f    -0.839072
s     0.408082
t     0.154251
fo   -0.666938
fi    0.964966
Name: Demo, dtype: float64

In [51]:
s2.f

np.int64(10)

In [52]:
s2.max()

np.int64(50)

In [53]:
s2.argmax()

np.int64(4)

In [54]:
s2=np.cos(s2)

In [55]:
s2

f    -0.839072
s     0.408082
t     0.154251
fo   -0.666938
fi    0.964966
Name: Demo, dtype: float64

#### Dataframe

In [56]:
#creating dataframe from dictionery
marks={
    "math":np.random.randint(30,60,size=(10,)),
    "science":np.random.randint(47,70,size=(10,)),
    "computer":np.random.randint(60,80,size=(10,)),
}
marks

{'math': array([53, 57, 34, 35, 38, 55, 57, 31, 45, 33], dtype=int32),
 'science': array([57, 63, 48, 49, 51, 69, 52, 60, 51, 51], dtype=int32),
 'computer': array([66, 63, 78, 74, 71, 68, 62, 77, 60, 66], dtype=int32)}

In [57]:
df= pd.DataFrame(marks)
df

   math  science  computer
0    53       57        66
1    57       63        63
2    34       48        78
3    35       49        74
4    38       51        71
5    55       69        68
6    57       52        62
7    31       60        77
8    45       51        60
9    33       51        66

In [58]:
marks_1=[
[30,52,	68],
[55,48,	70],
[39,59,	69],
[42,55,	64],
[56,60,	61],
[49,56,	69],
[49,53,	73],
[36,68,	72],
[34,55,	61],
[50,64,	77],
]
marks_1

[[30, 52, 68],
 [55, 48, 70],
 [39, 59, 69],
 [42, 55, 64],
 [56, 60, 61],
 [49, 56, 69],
 [49, 53, 73],
 [36, 68, 72],
 [34, 55, 61],
 [50, 64, 77]]

In [59]:
df2=pd.DataFrame(marks_1,columns=["Math","Science","Computer"])
df2

   Math  Science  Computer
0    30       52        68
1    55       48        70
2    39       59        69
3    42       55        64
4    56       60        61
5    49       56        69
6    49       53        73
7    36       68        72
8    34       55        61
9    50       64        77

In [60]:
marks_1=[
[30,52,	None],
[55,48,	70],
[39,59,	69],
[42,55,	64],
[43,60,	61],
[49,56,	69],
[49,53,	None],
[36,68,	72],
[34,None,	61],
[50,64,	77],
]
marks_1

[[30, 52, None],
 [55, 48, 70],
 [39, 59, 69],
 [42, 55, 64],
 [43, 60, 61],
 [49, 56, 69],
 [49, 53, None],
 [36, 68, 72],
 [34, None, 61],
 [50, 64, 77]]

In [61]:
df2=pd.DataFrame(marks_1,columns=["Math","Science","Computer"])
df2

   Math  Science  Computer
0    30     52.0       NaN
1    55     48.0      70.0
2    39     59.0      69.0
3    42     55.0      64.0
4    43     60.0      61.0
5    49     56.0      69.0
6    49     53.0       NaN
7    36     68.0      72.0
8    34      NaN      61.0
9    50     64.0      77.0

In [62]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Math      10 non-null     int64
 1   Science   9 non-null      float64
 2   Computer  8 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 372.0 bytes

In [63]:
list("acskfdlsjaf")

['a', 'c', 's', 'k', 'f', 'd', 'l', 's', 'j', 'a', 'f']

In [66]:
#adding new columns
df2['Remarks']=list("abcdaabbcc")

In [65]:
df2

   Math  Science  Computer Remarks
0    30     52.0       NaN       a
1    55     48.0      70.0       b
2    39     59.0      69.0       c
3    42     55.0      64.0       d
4    43     60.0      61.0       a
5    49     56.0      69.0       a
6    49     53.0       NaN       b
7    36     68.0      72.0       b
8    34      NaN      61.0       c
9    50     64.0      77.0       c

In [ ]:
#updating existing column because remarks column already exist in dataframe df2
df2['Remarks']=list("abcdacbbac")

In [68]:
df2

   Math  Science  Computer Remarks
0    30     52.0       NaN       a
1    55     48.0      70.0       b
2    39     59.0      69.0       c
3    42     55.0      64.0       d
4    43     60.0      61.0       a
5    49     56.0      69.0       c
6    49     53.0       NaN       b
7    36     68.0      72.0       b
8    34      NaN      61.0       a
9    50     64.0      77.0       c

In [69]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Math      10 non-null     int64
 1   Science   9 non-null      float64
 2   Computer  8 non-null      float64
 3   Remarks   10 non-null     object
dtypes: float64(2), int64(1), object(1)
memory usage: 452.0+ bytes

In [70]:
df2.describe()

            Math    Science   Computer
count  10.000000   9.000000   8.000000
mean   42.700000  57.222222  67.875000
std     8.028422   6.220486   5.566161
min    30.000000  48.000000  61.000000
25%    36.750000  53.000000  63.250000
50%    42.500000  56.000000  69.000000
75%    49.000000  60.000000  70.500000
max    55.000000  68.000000  77.000000

In [72]:
#show top 5 rows by default
df2.head(3)

   Math  Science  Computer Remarks
0    30     52.0       NaN       a
1    55     48.0      70.0       b
2    39     59.0      69.0       c

In [73]:
df2.tail(2)

   Math  Science  Computer Remarks
8    34      NaN      61.0       a
9    50     64.0      77.0       c

In [74]:
df2.sample(4)

   Math  Science  Computer Remarks
2    39     59.0      69.0       c
1    55     48.0      70.0       b
6    49     53.0       NaN       b
7    36     68.0      72.0       b

In [ ]:
# to access columns as series
df2['Math']

0    30
1    55
2    39
3    42
4    43
5    49
6    49
7    36
8    34
9    50
Name: Math, dtype: int64

In [77]:
#Acessing single columns as dataframe
df2[["Math"]]

   Math
0    30
1    55
2    39
3    42
4    43
5    49
6    49
7    36
8    34
9    50

In [ ]:
#Acessing Multiple columns as dataframe
df2[["Math","Computer"]]

   Math  Computer
0    30       NaN
1    55      70.0
2    39      69.0
3    42      64.0
4    43      61.0
5    49      69.0
6    49       NaN
7    36      72.0
8    34      61.0
9    50      77.0

In [80]:
df2["Math"].max()

np.int64(55)

In [81]:
df2.isna()

    Math  Science  Computer  Remarks
0  False    False      True    False
1  False    False     False    False
2  False    False     False    False
3  False    False     False    False
4  False    False     False    False
5  False    False     False    False
6  False    False      True    False
7  False    False     False    False
8  False     True     False    False
9  False    False     False    False

In [82]:
True+False+True+False

2

In [ ]:
#count number of nan in a dataframe
df2.isna().sum()

Math        0
Science     1
Computer    2
Remarks     0
dtype: int64

In [84]:
df3=df2.copy()

In [85]:
df3

   Math  Science  Computer Remarks
0    30     52.0       NaN       a
1    55     48.0      70.0       b
2    39     59.0      69.0       c
3    42     55.0      64.0       d
4    43     60.0      61.0       a
5    49     56.0      69.0       c
6    49     53.0       NaN       b
7    36     68.0      72.0       b
8    34      NaN      61.0       a
9    50     64.0      77.0       c

In [87]:
df2["Science"].fillna(0)

0    52.0
1    48.0
2    59.0
3    55.0
4    60.0
5    56.0
6    53.0
7    68.0
8     0.0
9    64.0
Name: Science, dtype: float64

In [91]:
mean=(1+2+5+6+7+9+1300)/7
mean

190.0

In [93]:
science_median=df2["Science"].median()

In [94]:
df2["Science"].fillna(science_median)

0    52.0
1    48.0
2    59.0
3    55.0
4    60.0
5    56.0
6    53.0
7    68.0
8    56.0
9    64.0
Name: Science, dtype: float64

In [95]:
computer_median=df2["Computer"].median()

In [96]:
df2["Computer"].fillna(computer_median)

0    69.0
1    70.0
2    69.0
3    64.0
4    61.0
5    69.0
6    69.0
7    72.0
8    61.0
9    77.0
Name: Computer, dtype: float64

In [ ]:
df2["Computer"].fillna(
    df2["Computer"].median())

0    69.0
1    70.0
2    69.0
3    64.0
4    61.0
5    69.0
6    69.0
7    72.0
8    61.0
9    77.0
Name: Computer, dtype: float64

In [103]:
# df2["Computer"].fillna(
#     df2["Computer"].median(),
#     inplace:True)
# df2

In [104]:
df3

   Math  Science  Computer Remarks
0    30     52.0       NaN       a
1    55     48.0      70.0       b
2    39     59.0      69.0       c
3    42     55.0      64.0       d
4    43     60.0      61.0       a
5    49     56.0      69.0       c
6    49     53.0       NaN       b
7    36     68.0      72.0       b
8    34      NaN      61.0       a
9    50     64.0      77.0       c

In [110]:
df3.dropna(subset=["Computer"]) #removes row with any nan

   Math  Science  Computer Remarks
1    55     48.0      70.0       b
2    39     59.0      69.0       c
3    42     55.0      64.0       d
4    43     60.0      61.0       a
5    49     56.0      69.0       c
7    36     68.0      72.0       b
8    34      NaN      61.0       a
9    50     64.0      77.0       c

In [112]:
df2["Total"]=df2["Math"]+df2["Computer"]+df2["Science"]
df2

   Math  Science  Computer Remarks  Total
0    30     52.0       NaN       a    NaN
1    55     48.0      70.0       b  173.0
2    39     59.0      69.0       c  167.0
3    42     55.0      64.0       d  161.0
4    43     60.0      61.0       a  164.0
5    49     56.0      69.0       c  174.0
6    49     53.0       NaN       b    NaN
7    36     68.0      72.0       b  176.0
8    34      NaN      61.0       a    NaN
9    50     64.0      77.0       c  191.0

In [113]:
df2["Grade"]=df2["Remarks"]
df2

   Math  Science  Computer Remarks  Total Grade
0    30     52.0       NaN       a    NaN     a
1    55     48.0      70.0       b  173.0     b
2    39     59.0      69.0       c  167.0     c
3    42     55.0      64.0       d  161.0     d
4    43     60.0      61.0       a  164.0     a
5    49     56.0      69.0       c  174.0     c
6    49     53.0       NaN       b    NaN     b
7    36     68.0      72.0       b  176.0     b
8    34      NaN      61.0       a    NaN     a
9    50     64.0      77.0       c  191.0     c

- Nominal Data
   - red blue white green purple
   - can be arranged in any way

- Ordinal Data
  - One hot encoding
  - bad good better best  here it can be arranged in 2 ways

In [ ]:
#label encoding
mapper={'a':0,'b':1,'c':2,'d':3}
df2['Grade']=df2['Grade'].map(mapper)
df2

   Math  Science  Computer Remarks  Total  Grade
0    30     52.0       NaN       a    NaN      0
1    55     48.0      70.0       b  173.0      1
2    39     59.0      69.0       c  167.0      2
3    42     55.0      64.0       d  161.0      3
4    43     60.0      61.0       a  164.0      0
5    49     56.0      69.0       c  174.0      2
6    49     53.0       NaN       b    NaN      1
7    36     68.0      72.0       b  176.0      1
8    34      NaN      61.0       a    NaN      0
9    50     64.0      77.0       c  191.0      2

In [ ]:
df2["Remarks"].unique()

array(['a', 'b', 'c', 'd'], dtype=object)

In [ ]:
#Gives number of unique values
df2["Remarks"].nunique()

4

In [120]:
pd.get_dummies(df2,columns=["Remarks"],dtype=int)

,Math,Science,Computer,Total,Grade,Remarks_a,Remarks_b,Remarks_c,Remarks_d
0,30,52.0,NaN,NaN,0,1,0,0,0
1,55,48.0,70.0,173.0,1,0,1,0,0
2,39,59.0,69.0,167.0,2,0,0,1,0
3,42,55.0,64.0,161.0,3,0,0,0,1
4,43,60.0,61.0,164.0,0,1,0,0,0
5,49,56.0,69.0,174.0,2,0,0,1,0
6,49,53.0,NaN,NaN,1,0,1,0,0
7,36,68.0,72.0,176.0,1,0,1,0,0
8,34,NaN,61.0,NaN,0,1,0,0,0
9,50,64.0,77.0,191.0,2,0,0,1,0

In [124]:
df2=pd.get_dummies(
    df2,columns=["Remarks"],
    dtype=int,
    drop_first=True,
    prefix="Re",
    prefix_sep="@")
df2

   Math  Science  Computer  Total  Grade  Re@b  Re@c  Re@d
0    30     52.0       NaN    NaN      0     0     0     0
1    55     48.0      70.0  173.0      1     1     0     0
2    39     59.0      69.0  167.0      2     0     1     0
3    42     55.0      64.0  161.0      3     0     0     1
4    43     60.0      61.0  164.0      0     0     0     0
5    49     56.0      69.0  174.0      2     0     1     0
6    49     53.0       NaN    NaN      1     1     0     0
7    36     68.0      72.0  176.0      1     1     0     0
8    34      NaN      61.0    NaN      0     0     0     0
9    50     64.0      77.0  191.0      2     0     1     0

In [126]:
df2=df2.rename(
    columns={
        "Math":"Mathematics",
        "Total":"Total_Score"
    }
)
df2

   Mathematics  Science  Computer  Total_Score  Grade  Re@b  Re@c  Re@d
0           30     52.0       NaN          NaN      0     0     0     0
1           55     48.0      70.0        173.0      1     1     0     0
2           39     59.0      69.0        167.0      2     0     1     0
3           42     55.0      64.0        161.0      3     0     0     1
4           43     60.0      61.0        164.0      0     0     0     0
5           49     56.0      69.0        174.0      2     0     1     0
6           49     53.0       NaN          NaN      1     1     0     0
7           36     68.0      72.0        176.0      1     1     0     0
8           34      NaN      61.0          NaN      0     0     0     0
9           50     64.0      77.0        191.0      2     0     1     0